{
    "id": "122",
    "query": "Does Aleve relieve migraine headaches?",
    "snippets": [
        {
            "docId": "en.noclean.c4-train.02033-of-07168.54843",
            "title": "Aleve (naproxen) vs. Celebrex (celecoxib) Effectiveness",
            "url": "https://www.medicinenet.com/aleve_naproxen_vs_celebrex_celecoxib/article.htm",
            "description": "Celebrex have similar side effects, for example, nausea, abdominal pain, indigestion, heartburn, diarrhea, and headache. Aleve also causes ringing in the ears, constipation, sleepiness, edema, shortness of breath, dizziness, and rash.",
            "score": "E"
        }, {
            "docId": "en.noclean.c4-train.00204-of-07168.4011",
            "title": "Prep School Daily: Conventional Medicine--OTC Pain Relievers",
            "url": "https://prepschooldaily.blogspot.com/2018/12/traditional-medicine-otc-pain-relievers.html",
            "description": "Aleve is used to treat migraine, osteoarthritis, rheumatoid arthritis, psoriatic arthritis, kidney stones, gout, tendinitis, bursitis, and menstrual cramps. It is not indicated for diabetic neuropathy.",
            "score": "B"
        }, {
            "docId": "en.noclean.c4-train.03350-of-07168.59627",
            "title": "sawmillcreek",
            "url": "https://sawmillcreek.org/archive/index.php/t-211509.html?s=530f4eea9c564231000ca441d35f8965",
            "description": "Larry Edgerton 12-18-2013, 5:52 PM Thanks Andrew, I will pass this on to my wife who gets migraines occasionally. I was told by my doctor that Aleve was not hard on your liver.",
            "score": "C"
        }, {
            "docId": "en.noclean.c4-train.01594-of-07168.53770",
            "title": " What is the difference between Tylenol, Advil, Aleve, acetaminophen, ibuprofen, asprin, etc.? | Interesting Answers",
            "url": "https://www.interestinganswers.com/health/what-is-the-difference-between-tylenol-advil-aleve-acetaminophen-ibuprofen-asprin-etc/",
            "description": "Below is a list of all the major OTC pain relievers/fever reducers sold in the U.S. along with their active ingredients (per pill). ACETAMINOPHEN PRODUCTS Tylenol Regular Strength: Acetaminophen, 335 mg Tylenol Extra Strength: Acetaminophen, 500 mg Tylenol 8 Hour Muscle Aches and Pain: Acetaminophen (extended release), 650 mg Tylenol Arthritis Pain: Acetaminophen, 625 mg Tylenol PM: Acetaminophen, 500 mg / Diphenhydramine (a.k.a Benadryl) (sleep aid), 25mg Midol: Acetaminophen, 500 mg / Caffeine (stimulant), 60 mg / Pyrilamine Maleate (antihistamine), 15mg Midol Long Lasting Relief: Acetaminophen, (extended release), 650 mg Midol Teen: Acetaminophen, 500 mg / Pamabrom (diuretic), 25 mg Midol Complete: Acetaminophen, 500 mg / Caffeine (stimulant), 60 mg / Pyrilamine maleate (antihistamine), 15 mg Excedrin PM: Acetaminophen, 500 mg / Diphenhydramine (a.k.a Benadryl) (sleep aid), 38 mg Excedrine Tension Headache: Acetaminophen, 500 mg / Caffeine 65 mg Goody’s PM: Acetaminophen, 500 mg / Diphenhydramine (a.k.a Benadryl) (sleep aid), 38 mg NSAID PRODUCTS IBUPROFEN Advil: Ibuprofen, 200 mg Advil Liquid Gels: Solubilized ibuprofen, 200 mg Advil Migraine: Solubilized ibuprofen, 200 mg Advil Film-Coated: Ibuprofen sodium, 256 mg Motrin IB: Ibuprofen, 200 mg Motrin IB Liquid Gels: Ibuprofen, 200 mg Motrin PM: Ibuprofen, 200 mg / Diphenhydramine citrate(sleep aid), 38 mg NAPROXEN SODIUM Aleve: Naproxen sodium, 220 mg ASPRIN Bayer: Asprin, 324 mg Bayer Low Dose: Asprin, 81 mg Bayer Back & Body: Asprin, 500 mg / Caffeine (stimulant), 32.5 mg St. Joseph Low Dose: Asprin, 81 mg Bufferin: Buffered aspirin, 325 mg Anacin: Asprin, 400 mg / Caffeine (stimulant), 32 mg COMBINATION PRODUCTS Excedrin Extra Strength: Acetaminophen, 250 mg / Aspirin, 250 mg / Caffeine, 65 mg Excedrin Migraine: Acetaminophen, 250 mg / Aspirin, 250 mg / Caffeine, 65 mg Vanquish: Acetaminophen, 194 mg / Aspirin 227, mg / Caffeine, 33 mg Goody’s Extra Strength Headache Relief Powder: Acetaminophen, 260 mg / Aspirin, 520 mg / Caffeine, 32.5 mg Goody’s Back & Body Pain: Acetinimophin, 325 mg / Asprin, 500 mg Please help me out by clicking the LIKE button if you enjoyed reading this.",
            "score": "A"
        }, {
            "docId": "en.noclean.c4-train.04175-of-07168.17784",
            "title": "The Best Pain Reliever for You | SELF",
            "url": "https://www.self.com/story/best-pain-reliever-when-to-take-nsaids-and-acetaminophen",
            "description": "When naproxen is sold over the counter as Aleve, the normal dose is 220 mg. “If you have pain or fever, one Aleve should do it, anything more than that—like gout or arthritis—and you may need higher doses as directed by a physician,” says Sonpal. That’s because the full anti-inflammatory effect doesn't kick in unless you're taking doses of around 500 mg of naproxen (or 600 mg of ibuprofen) at a time, says Van Groningen.",
            "score": "A"
        }, {
            "docId": "en.noclean.c4-train.04831-of-07168.65369",
            "title": "clinicaltrials",
            "url": "https://www.clinicaltrials.gov/ct2/show/NCT01450995?term=SUMATRIPTAN&amp;rank=63",
            "description": "The other 25 patients will administer 2 Aleve and 100mg Imitrex taken concomitantly as needed for 3 months and then Treximet as needed for 3 months. In addition to Revised Patient Perception of Migraine Questionnaire (PPMQ-R)data, a detailed diary will be recorded regarding number of tablets taken per attack, compliance, rescue treatment, when patients treated their migraine attack (mild, moderate, or severe), onset of pain reduction (pain relief and pain free, and 24 hour pain relief and sustained pain free response.",
            "score": "D"
        }, {
            "docId": "en.noclean.c4-train.01607-of-07168.115747",
            "title": "ibuprofen-with-tylenol",
            "url": "https://www.healthtap.com/topics/ibuprofen-with-tylenol",
            "description": "Get a more detailed answer › Dr. Andrew Germanovich Dr. Germanovich 2 doctors agreed: 3 3 Can i combine Aleve with tylenol (acetaminophen)? Dr. Andrew Germanovich Dr. Germanovich 2 doctors agreed: Yes: Different mechanisms, additive pain relieving effect.",
            "score": "A"
        }, {
            "docId": "en.noclean.c4-train.05036-of-07168.132769",
            "title": "im-13-weeks-pregnant-is-it-safe-to-take-extra-strength-tylenol-acetaminophen-for-headache",
            "url": "https://www.healthtap.com/user_questions/488785-im-13-weeks-pregnant-is-it-safe-to-take-extra-strength-tylenol-acetaminophen-for-headache",
            "description": "23, 2012 21 years experience in Family Medicine Excedrine migraine. If you never had headaches/migraines in past, you should consut doc for an eval...If you had this before and feels similar pain etc...Excedrine migraine and/or aleve/motrin may help.",
            "score": "C"
        }, {
            "docId": "en.noclean.c4-train.05236-of-07168.49379",
            "title": "The 9 Best OTC Pain Relievers of 2021",
            "url": "https://www.verywellhealth.com/best-otc-pain-relievers-4171963",
            "description": "Make sure to follow the product guidelines and talk to your doctor if you experience any discomfort. Beyond your back, Aleve can also be used to treat menstrual cramps, toothaches and more.",
            "score": "E"
        }, {
            "docId": "en.noclean.c4-train.00600-of-07168.85496",
            "title": "naproxen (Aleve, Naprosyn) – drug class, medical uses, medication side effects, and drug interactions by MedicineNet.com",
            "url": "https://www.medicinenet.com/naproxen/article.html",
            "description": "Naproxen (Aleve) Side Effects, Dosage & Interactions MedicineNet SYMPTOM CHECKER Disease & Conditions Conditions A-Z Procedures A-Z Allergies Alzheimer's Arthritis Asthma Blood Pressure Cancer Cholesterol Chronic Pain Cold & Flu Depression Diabetes Digestion Eyesight Health & Living Healthy Kids Hearing & Ear Heart HIV/AIDS Infectious Disease Lung Conditions Menopause Men's Health Mental Health Migraine Neurology Oral Health Pregnancy Senior Health Sexual Health Skin Problems Sleep Thyroid Travel Health Women's Health Gastroenterology Hemorrhoids Diabetes Diabetes (Type 1 and Type 2) Teen Health Bullying Dermatology Jock Itch Drugs & Supplements Medications Supplements and Vitamins ADHD Vyvanse vs. Strattera Sleep Disorder Benzodiazepines Depression Zoloft Health & Living Diet & Weight Management Exercise & Fitness Nutrition, Food & Recipes Prevention & Wellness Digestive Problems Low Fiber Diet Fitness, Exercise, Sports Aerobic Exercise Digestive Problems Probiotics Media All Slideshows Adult Skin Conditions Common Eye Problems and Infections Sexually Transmitted Diseases All Quizzes Diet and Nutrition Quiz Heart Disease Quiz Kidney Disease Quiz All Images Genital Warts Scabies Alopecia Areata MedTerms Dictionary Slideshows Quizzes Images Privacy Policy About Us Contact Us Terms of Use Advertising Policy ©1996-2018 MedicineNet, Inc. All rights reserved. Terms of Use.",
            "score": "A"
        }
    ]
} 